# IdeaStatiCa.ConnectionApi.Model.LoadEffectData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Description** | **string** |  | [optional]
**IsActive** | **bool** |  | [optional]
**InternalForces** | **List&lt;int&gt;** |  | [optional]
**Purpose** | **EPurpose** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)